; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-1-9-7)
(:domain gripper-strips)
(:objects robot1 - robot
rgripper1 lgripper1 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 - object)
(:init
(at-robby robot1 room5)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at ball1 room4)
(at ball2 room3)
(at ball3 room1)
(at ball4 room6)
(at ball5 room5)
(at ball6 room5)
(at ball7 room9)
)
(:goal
(and
(at ball1 room3)
(at ball2 room3)
(at ball3 room7)
(at ball4 room9)
(at ball5 room1)
(at ball6 room5)
(at ball7 room3)
)
)
)

; plan
1. (pick robot1 ball5 room5 lgripper1)
   deleted: (at ball5 room5) (free robot1 lgripper1)
   added: (carry robot1 ball5 lgripper1)
   goals met: 2 of 7
2. (move robot1 room5 room9)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room9)
   goals met: 2 of 7
3. (pick robot1 ball7 room9 rgripper1)
   deleted: (at ball7 room9) (free robot1 rgripper1)
   added: (carry robot1 ball7 rgripper1)
   goals met: 2 of 7
4. (move robot1 room9 room1)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room1)
   goals met: 2 of 7
5. (drop robot1 ball5 room1 lgripper1)
   deleted: (carry robot1 ball5 lgripper1)
   added: (at ball5 room1) (free robot1 lgripper1)
   goals met: 3 of 7
6. (move robot1 room1 room3)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room3)
   goals met: 3 of 7
7. (drop robot1 ball7 room3 rgripper1)
   deleted: (carry robot1 ball7 rgripper1)
   added: (at ball7 room3) (free robot1 rgripper1)
   goals met: 4 of 7
8. (move robot1 room3 room6)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room6)
   goals met: 4 of 7
9. (pick robot1 ball4 room6 lgripper1)
   deleted: (at ball4 room6) (free robot1 lgripper1)
   added: (carry robot1 ball4 lgripper1)
   goals met: 4 of 7
10. (move robot1 room6 room9)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room9)
   goals met: 4 of 7
11. (drop robot1 ball4 room9 lgripper1)
   deleted: (carry robot1 ball4 lgripper1)
   added: (at ball4 room9) (free robot1 lgripper1)
   goals met: 5 of 7
12. (move robot1 room9 room7)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room7)
   goals met: 5 of 7
13. (move robot1 room7 room4)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room4)
   goals met: 5 of 7
14. (pick robot1 ball1 room4 lgripper1)
   deleted: (at ball1 room4) (free robot1 lgripper1)
   added: (carry robot1 ball1 lgripper1)
   goals met: 5 of 7
15. (move robot1 room4 room7)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room7)
   goals met: 5 of 7
16. (move robot1 room7 room3)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room3)
   goals met: 5 of 7
17. (drop robot1 ball1 room3 lgripper1)
   deleted: (carry robot1 ball1 lgripper1)
   added: (at ball1 room3) (free robot1 lgripper1)
   goals met: 6 of 7
18. (move robot1 room3 room7)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room7)
   goals met: 6 of 7
19. (move robot1 room7 room1)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room1)
   goals met: 6 of 7
20. (pick robot1 ball3 room1 lgripper1)
   deleted: (at ball3 room1) (free robot1 lgripper1)
   added: (carry robot1 ball3 lgripper1)
   goals met: 6 of 7
21. (move robot1 room1 room7)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room7)
   goals met: 6 of 7
22. (drop robot1 ball3 room7 lgripper1)
   deleted: (carry robot1 ball3 lgripper1)
   added: (at ball3 room7) (free robot1 lgripper1)
   goals met: 7 of 7
